{
  "name": "Bone dagger",
  "icon": "divinefavor:bone_dagger",
  "category": "basics",
  "read_by_default": true,
  "sortnum": 1,
  "pages": [
    {
      "type": "text",
      "text": "Very first tool thar you should create is bone dagger. While not very useful as a weapon it is an essential tool for spiritualist. Activation of special ability of this dagger is pretty straightforward, just attack some mobs with it and sooner or later it will awaken and transform into awakened dagger."
    },
    {
      "type": "crafting",
      "text": "$(item)Bone dagger$() recipe",
      "recipe": "divinefavor:bone_dagger"
    },
    {
      "type": "spotlight",
      "item": "divinefavor:bone_dagger_awakened",
      "text": "Awakened bone dagger possess unique ability. When someone attacked with it instead of bleeding with blood they will bleed soul. Soul expelled from body will instantly crystallize into soul crystal. Amount of lost soul is extremely small and thus this process will not cause any permanent damage to the attacked creature. "
    },
    {
      "type": "text",
      "text": "Crystallized soul fragment remains connected to original soul and can be used to affect connected creature. Also soul shards have some unnatural properties and often used as part of occult recipes. Soul shards vary depending on the source creature. Currently there are 9 known soul shards."
    },
    {
      "type": "text",
      "text": "Soul shard types: $(li)Shard of end $(li)Shard of mind $(li)Shard of nether $(li)Shard of peace $(li)Shard of undeath $(li)Shard of water $(li)Shard of wild $(li)Shard of wither $(li)Shard of soul"
    },
    {
      "type": "spotlight",
      "item": "divinefavor:soul_shard_end",
      "text": "Soul shard crystallized from soul of otherworldly creatures of end dimension. Can be extracted from endermans, endermites, and shulkers. Also can be extracted from ender dragon inf you seek challenge."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:soul_shard_mind",
      "text": "Soul shard crystallized from soul of intelligent being. Can be extracted from any type of villager."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:soul_shard_nether",
      "text": "Soul shard crystallized from soul of hellish creature. Can be extracted from pigmans, magma cubes, blazes and any type hellish creature not related to wither."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:soul_shard_peace",
      "text": "Soul shard crystallized from soul of peaceful creature. Can be extracted from pigs, cows, chickens and any other type of neutral creature."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:soul_shard_undeath",
      "text": "Soul shard crystallized from soul of undead creature. Can be extracted from any type of zombies or skeleton."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:soul_shard_water",
      "text": "Soul shard crystallized from soul of aquatic creature. Can be extracted from squids or guardians."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:soul_shard_wild",
      "text": "Soul shard crystallized from soul of wild hostile creature. Can be extracted from creepers, spiders and slimes."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:soul_shard_will",
      "text": "Special soul shard crystallized from soul of player. Can be extracted from any player."
    }
  ]
}