{
  "name": "Destruction talismans",
  "icon": "divinefavor:tool_talisman_destroy_surface",
  "category": "block_manipulation",
  "read_by_default": true,
  "sortnum": 4,
  "pages": [
    {
      "type": "spotlight",
      "item": "divinefavor:tool_talisman_destroy_surface",
      "text": "Some spell talismans can be collectively called 'Destruction talismans'. Above you can see an example. There are no special tool required for them, they are just spell talismans, but they behaviour is similar to each other. "
    },
    {
      "type": "text",
      "text": "Destruction talismans destroy blocks instantly without blocks. However each talisman selects which blocks to destroy differently. Specifics for each talisman will be shown on later pages. Before you can use any of those talismans you need to select which type of block you want to destroy. To select block type just sneak right click any block."
    },
    {
      "type": "text",
      "text": "When destruction talisman is used it will destroy selected blocks instantly. Remember that destroyed blocks will not drop any resources, and will just be annihilated.Also most of the destruction talismans have property 'Fuzzy'. If this property is enabled then talisman will only destroy blocks of the same type as the block that player is selected. If this property is disabled then talisman will destroy any encountered blocks regardless of type."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:tool_talisman_destroy_blocks",
      "text": "This talisman will destroy block that player is looking at and blocks adjacent to this block. You can select how many adjacent blocks need to ber destroyed."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:tool_talisman_destroy_cuboid",
      "text": "This talisman will destroy blocks inside of arbitrary sized cuboid. You can freely adjust size and position of this cuboid."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:tool_talisman_destroy_side",
      "text": "This talisman will destroy block that player is looking at and blocks adjacent to this block that are on the same straight side. You can select how many adjacent blocks need to ber destroyed."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:tool_talisman_destroy_surface",
      "text": "This talisman will destroy block that player is looking at and blocks adjacent to this block that are on the same surface. You can select how many adjacent blocks need to ber destroyed."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:tool_talisman_destroy_surface",
      "text": "This talisman will destroy block that player is looking at and blocks adjacent to this block that are on the same surface. You can select how many adjacent blocks need to ber destroyed."
    },
    {
      "type": "spotlight",
      "item": "divinefavor:spell_talisman_destroy_cuboid_remotely",
      "text": "This talisman will destroy blocks inside of arbitrary sized cuboid. You can freely adjust size and position of this cuboid. This talisman is not a tool talisman like most other destruction talismans and can destroy blocks remotely"
    }
  ]
}
